yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/InformationRegisters/СК_Инвентаризация/СК_Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_Инвентаризация</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ФормаИнвентаризацииЯчейки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	ЭтотОбъект.ДокументПересчета = СтруктураПараметров.ДокументПересчета;	
	ЭтотОбъект.Секция = СтруктураПараметров.Секция;
	ЭтотОбъект.Номенклатура = СтруктураПараметров.Номенклатура;
	ЭтотОбъект.Ячейка = СтруктураПараметров.Ячейка;  
	Если Не ЭтотОбъект.Ячейка.Пустая() Тогда
		ЭтаФорма.ШКЯчейки = ЭтотОбъект.Ячейка;
	КонецЕсли;

	ЗаполнитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму()
	Элементы.Отсканировано.Заголовок = "";
	Элементы.Факт.Заголовок = "";
	// Проверка на заполненность реквизитов
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) 
		ИЛИ Не ЗначениеЗаполнено(ДокументПересчета.Ссылка) 
		ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.Секция) Тогда
			Элементы.Отсканировано.Заголовок = "Факт: 0 шт";
			Элементы.Изменить.Видимость = Ложь;
			Элементы.Закрыть.Видимость = Ложь;
			Элементы.Добавить.Видимость = Истина;		
		Возврат;
	КонецЕсли;

	Элементы.Факт.Заголовок = "План: " + Строка(Обработки.СК_МобСклад.ПолучитьОстатокПоСкладу(ЭтотОбъект.Номенклатура,ДокументПересчета.Ссылка.Дата,ДокументПересчета.Ссылка.Склад)) +" шт" ;

	ТабДокументПересчета = Обработки.СК_МобСклад.ТабДокументовПересчет(ДокументПересчета.Ссылка.СК_НомерПересчета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Ячейка КАК Ячейка,
	               |	СК_Инвентаризация.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |ГДЕ
	               |	СК_Инвентаризация.Номенклатура = &Номенклатура
	               |	И СК_Инвентаризация.ДокументПересчета В (&ДокументПересчета)
	               //|	И СК_Инвентаризация.Ячейка.Секция = &Секция
				   |"; 
	
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("ДокументПересчета", ТабДокументПересчета);
	//Запрос.УстановитьПараметр("Секция", ЭтотОбъект.Секция);

	Попытка
		Рез = Запрос.Выполнить().Выгрузить();
	Исключение
		Сообщить(ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;

	Если Рез.Количество() = 1  Тогда
		КоличествоОтсканировано = Рез.Итог("Количество");
		Если ЭтотОбъект.Ячейка = Рез[0].Ячейка Тогда
			Элементы.Отсканировано.Заголовок = "Факт: " + Строка(Рез[0].Ячейка)+ " - " +  Строка(КоличествоОтсканировано) + " шт";
			Элементы.Изменить.Видимость = Истина;
			Элементы.Закрыть.Видимость = Истина;
			Элементы.Добавить.Видимость = Ложь;
		Иначе
			Элементы.Отсканировано.Заголовок = "Факт: " + Строка(Рез[0].Ячейка)+ " - " + Строка(КоличествоОтсканировано) + " шт";
		КонецЕсли;

	ИначеЕсли Рез.Количество() > 1  Тогда 
		Факт = "";
		Для каждого СтрокаТЧ Из Рез Цикл
			Факт = Факт + Строка(СтрокаТЧ.Ячейка)+" - " + Строка(СтрокаТЧ.Количество) + " шт" + Символы.ПС; 
			Если ЭтотОбъект.Ячейка = СтрокаТЧ.Ячейка Тогда 
				Элементы.Изменить.Видимость = Истина;
				Элементы.Закрыть.Видимость = Истина;
				Элементы.Добавить.Видимость = Ложь;
				//Прервать;
			КонецЕсли;
		КонецЦикла; 
		Элементы.Отсканировано.Заголовок = "Факт: " + Строка(Факт);

	Иначе
		Элементы.Отсканировано.Заголовок = "Факт: 0 шт";
		Элементы.Изменить.Видимость = Ложь;
		Элементы.Закрыть.Видимость = Ложь;
		Элементы.Добавить.Видимость = Истина;		
	КонецЕсли;
    ЭтаФорма.СканШК = ЭтотОбъект.Номенклатура; 
	ЭтотОбъект.НаименованиеНоменклатуры = ЭтотОбъект.Номенклатура;

КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();

КонецПроцедуры    

&НаКлиенте
Процедура АктивироватьПоискЯчейки() 
	ОчиститьШКСервер(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	//ШКЯчейки = "";
	//СканШК = "";
	Количество = 0;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеБуфер(Параметры) Экспорт  
			ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
			АктивироватьПоискЯчейки();
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	Если Текст = "0000000000001" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Буфер не сканировать!!! ",5,"Ошибка");
		
	Иначе	
		
		Если ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст) = Истина Тогда
			АктивироватьПоискСканШК();
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Отсканируйте правильную ячейку ",5,"Ошибка");
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура АктивироватьПоискСканШК() 
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Функция ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)

	
	ЯчейкаПоиск = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)).Ссылка;
	
	Если ЯчейкаПоиск.Секция = Секция Тогда 
		ЭтаФорма.ШКЯчейки = ЯчейкаПоиск;
		
		ЭтотОбъект.Ячейка = ЯчейкаПоиск;
		Возврат Истина;	
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	//СК = СканШКИзменениеТекстаРедактированияНаСервере(Текст);
	
	Если СканШКИзменениеТекстаРедактированияНаСервере(Текст) = Ложь Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Номенклатура не найдена ",5,"Ошибка");
	Иначе
		ЭтаФорма.Количество = 1;
		ЗаполнитьФорму();
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура АктивироватьКОличество() 
	ОчиститьШКСервер(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Функция СканШКИзменениеТекстаРедактированияНаСервере(Шк)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод",Шк);
 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		
		ЭтотОбъект.Номенклатура = Рез.Номенклатура.Ссылка;
 		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Процедура ДобавитьНаСервере()
	ЭтотОбъект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	ЭтаФорма.ШКЯчейки = "";
	ЭтаФорма.СканШК = "";
	ЭтотОбъект.НаименованиеНоменклатуры = "";
	ЭтотОбъект.Ячейка  = Справочники.СК_Ячейки.ПустаяСсылка();
	ЭтотОбъект.Количество = 0;
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)  
	Если ЭтаФорма.Количество = 0 Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Укажите количество",5,"");
	Иначе
		КоличествоПриИзмененииНаСервере();
		ДобавитьНаСервере();
		ЗаполнитьФорму();
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискЯчейки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)

	ИзменитьКоличествоСканирования();
	ЗаполнитьФорму();
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение,"Количество изменено ",5,"");

КонецПроцедуры
//////
&НаСервере
Процедура ИзменитьКоличествоСканирования() 
	
	ТекПользователь = Пользователи.АвторизованныйПользователь().Ссылка; 
	
	НаборЗаписей = РегистрыСведений.СК_Инвентаризация.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Номенклатура.Установить(ЭтотОбъект.Номенклатура);
	НаборЗаписей.Отбор.Ячейка.Установить(ЭтотОбъект.Ячейка);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];

		Если ЭтаФорма.Количество = 0 Тогда
			НаборЗаписей.Удалить(НЗапись);  
		Иначе
			НЗапись.Количество = ЭтаФорма.Количество; 
		КонецЕсли;
		
	КонецЕсли;  
	
	НаборЗаписей.Записать();
	
	// Вставить содержимое обработчика.
КонецПроцедуры
////////////
&НаСервере
Процедура КоличествоПриИзмененииНаСервере() 
	
	ТекПользователь = Пользователи.АвторизованныйПользователь().Ссылка; 
	
	НаборЗаписей = РегистрыСведений.СК_Инвентаризация.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Номенклатура.Установить(ЭтотОбъект.Номенклатура);
	НаборЗаписей.Отбор.Ячейка.Установить(ЭтотОбъект.Ячейка);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекПользователь);
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НЗапись = НаборЗаписей.Добавить();
		НЗапись.Номенклатура = ЭтотОбъект.Номенклатура;
		НЗапись.Ячейка = ЭтотОбъект.Ячейка;
		НЗапись.Количество = ЭтаФорма.Количество;
		НЗапись.Пользователь = ТекПользователь;
		НЗапись.ДокументПересчета = ЭтотОбъект.ДокументПересчета;
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];
		НЗапись.Количество = НЗапись.Количество + ЭтаФорма.Количество;
	КонецЕсли;
	НаборЗаписей.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	//КоличествоПриИзмененииНаСервере(); 
	//ЗаполнитьФорму();
КонецПроцедуры

&НаСервере
Процедура ПлюсНаСервере()
	ЭтаФорма.Количество = ЭтаФорма.Количество + 1;
КонецПроцедуры

&НаКлиенте
Процедура Плюс(Команда)
	ПлюсНаСервере();
КонецПроцедуры

&НаСервере
Процедура МинусНаСервере()
	ЭтаФорма.Количество = ЭтаФорма.Количество - 1;
КонецПроцедуры

&НаКлиенте
Процедура Минус(Команда)
	МинусНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	
    Ответ = Вопрос("Очистить поля?",
        РежимДиалогаВопрос.ДаНет,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Очистить поля" // (необ.) заголовок
        );
 
    Если Ответ = КодВозвратаДиалога.Да Тогда
		ДобавитьНаСервере();
		ЗаполнитьФорму(); 
		АктивироватьПоискЯчейки();
    КонецЕсли;	
КонецПроцедуры
